#pragma once

#include <bitset>

#include "../Utils/HMath.h"
#include "../Utils/Utils.h"
#include "CBlockLegacy.h"
#include "CEntityList.h"
#include "CInventory.h"
#include "CInventoryTransaction.h"
#include "TextHolder.h"

class C_GameMode;

class PointingStruct {
	char pad_0x0000[0xA28];  //0x0000
public:
	int rayHitType;    //0x08E0
	int blockSide;     //0x08E4
	vec3_ti block;     //0x08E8
	vec3_t rayHitVec;  //0x08F4
private:
	C_Entity *entityPtr;          //0x0900
	C_Entity *entityPtr2;         //0x0908
	uint64_t GamingEntityFinder;  //0x0910

public:
	bool hasEntity();       //to not go trough the entity list twice
	C_Entity *getEntity();  //returns the entity that the player is looking at
};

class C_Player;
struct MobEffectInstance;

#pragma pack(push, 4)
class C_Entity {
public:
public:
	uint64_t ptrToEntityList;  //0x0008
private:
	char pad_0010[296];  //0x0010
public:
	union {
		struct {
			float pitch;  //0x0138
			float yaw;    //0x013C
		};
		vec2_t viewAngles;
	};
	union {
		struct {
			float pitch2;  //0x0138
			float yaw2;    //0x013C
		};
		vec2_t viewAngles2;
	};

private:
	char pad_0148[16];  //0x0148
public:
	vec3_t eyePos0;  //0x0158
private:
	char pad_0164[112];  //0x0164
public:
	float fallDistance;  //0x01D4
	bool onGround;       //0x01D8
private:
	char pad_01D9[95];  //0x01D9
public:
	float stepHeight;  //0x0238
private:
	char pad_023C[16];  //0x023C
public:
	vec3_t slowdownFactor;  //0x024C
private:
	char pad_0258[5];  //0x0258
public:
	bool didEnterWaterBool;  //0x025D
private:
	char pad_025E[1];  //0x025E
public:
	bool hasEnteredWaterBool;  //0x025F
private:
	char pad_0260[72];  //0x0260
public:
	int32_t ticksAlive;  //0x02A8
private:
	char pad_02AC[180];  //0x02AC
public:
	class C_BlockSource *region;  //0x0360
private:
	char pad_0368[8];  //0x0368
public:
	class PointingStruct *pointingStruct;  //0x0370
private:
	char pad_0378[328];  //0x0378
public:
	AABB aabb;          //0x04C0
	float width;        //0x04D8
	float height;       //0x04DC
	vec3_t currentPos;  //0x04E0
	vec3_t oldPos;      //0x04EC
	vec3_t velocity;    //0x04F8
	vec3_t velocity2;   //0x0504
private:
	char pad_0510[80];  //0x0510
public:
	int64_t entityRuntimeId;  //0x0560
private:
	char pad_0568[480];  //0x0568
public:
	float bodyYaw;                    //0x0748
	float oldBodyYaw;                 //0x074C
	float yawUnused1;                 //0x0750
	float yawUnused2;                 //0x0754
	int32_t damageTime;               //0x0758
	int32_t damageAnimationDuration;  //0x075C
private:
	char pad_0760[136];  //0x0760
public:
	int32_t timeSinceDeath;  //0x07E8
private:
	char pad_07EC[244];  //0x07EC
public:
	class TextHolder playerName;  //0x08E0
private:
	char pad_0900[140];  //0x0900
public:
	bool canFly;  //0x098C
private:
	char pad_098D[1667];  //0x098D
public:
	int32_t ticksUsingItem;  //0x1010
private:
	char pad_1014[20];  //0x1014
public:
	int16_t itemData;  //0x1028
	int16_t itemId;    //0x102A
private:
	char pad_102C[508];  //0x102C
public:
	class C_InventoryTransactionManager transac;  //0x1228
private:
	char pad_1288[2812];  //0x1288
public:
	int32_t gamemode;  //0x1D84

	virtual __int64 getLastHurtByMob(void);                                                                                // 0
	virtual __int64 setLastHurtByMob(C_Entity *);                                                                          // 1
	virtual __int64 getLastHurtByPlayer(void);                                                                             // 2
	virtual __int64 setLastHurtByPlayer(C_Player *);                                                                       // 3
	virtual __int64 getLastHurtMob(void);                                                                                  // 4
	virtual __int64 setLastHurtMob(C_Entity *);                                                                            // 5
	virtual __int64 outOfWorld(void);                                                                                      // 6
