#pragma once

#include "../Utils/HMath.h"
#include "CBlockLegacy.h"
#include "CEntityList.h"
#include "CInventory.h"
#include "CInventoryTransaction.h"
#include "TextHolder.h"

class C_GameMode;

class PointingStruct {
	char pad_0x0000[0x980];  //0x0000
public:
	int rayHitType;    //0x08E0
	int blockSide;     //0x08E4
	vec3_ti block;     //0x08E8
	vec3_t rayHitVec;  //0x08F4
private:
	C_Entity *entityPtr;   //0x0900
	C_Entity *entityPtr2;  //0x0908
	uint64_t entityLocalId;  //0x0910

public:
	bool hasEntity();       //to not go trough the entity list twice
	C_Entity *getEntity();  //returns the entity that the player is looking at
};

class C_Player;

typedef __int64 ActorUniqueID;


#pragma pack(push, 4)
class C_Entity {
public:
	uint64_t ptrToEntityList;                     //0x0008
	__int64 entityLocalId;
private:
	char pad_0010[296];                           //0x0010
public:
	union {
		struct {
			float pitch;  
			float yaw;    
		};
		vec2_t viewAngles;
	};
	union {
		struct {
			float pitch2;
			float yaw2;
		};
		vec2_t viewAngles2;  
	};

private:
	char pad_0150[16];  //0x0150
public:
	vec3_t eyePos0;  //0x0160
private:
	char pad_016C[112];  //0x016C
public:
	float fallDistance;  //0x01DC
	bool onGround;     //0x01E0
private:
	char pad_01E1[95];  //0x01E1
public:
	float stepHeight;  //0x0240
	float web;         //0x0244
private:
	char pad_0248[29];  //0x0248
public:
	bool feetUnderwater;  //0x0265
private:
	char pad_0266[1];  //0x0266
public:
	bool hasEnteredWater;  //0x0267
private:
	char pad_0268[72];  //0x0268
public:
	int32_t ticksAlive;  //0x02B0
private:
	char pad_02B4[180];  //0x02B4
public:
	class C_BlockSource *region;  //0x0368
private:
	char pad_0370[8];  //0x0370
public:
	class PointingStruct *pointingStruct;  //0x0378
private:
	char pad_0380[336];  //0x0380
public:
	struct AABB aabb;    //0x04D0
	float width;        //0x04EC
	float height;       //0x04F0
	vec3_t currentPos;  //0x04F4
	vec3_t oldPos;      //0x0500
	vec3_t velocity;    //0x050C
	vec3_t velocity2;   //0x0518
private:
	char pad_0524[92];  //0x0524
public:
	int64_t entityRuntimeId;  //0x0580
private:
	char pad_0588[408];  //0x0588
public:
	float bodyYaw;                    //0x0720
	float oldBodyYaw;                 //0x0724
	float yawUnused1;                 //0x0728
	float yawUnused2;                 //0x072C
	int32_t damageTime;               //0x0730
	int32_t damageTotalTime;               //0x0734
private:
	char pad_0738[136];  //0x0738
public:
	int32_t timeSinceDeath;  //0x07C0
private:
	char pad_07C4[520];  //0x07C4
public:
	bool canFly;  //0x09CC
private:
	char pad_09CD[1779];  //0x09CD
public:
	int16_t itemData;  //0x10C0
	int16_t itemId;    //0x10C2
private:
	char pad_10C4[508];  //0x10C4
public:
	class C_InventoryTransactionManager transac;  //0x12C0
private:
	char pad_1320[2796];  //0x1320
public:
	int32_t gamemode;  //0x1E0C


	virtual bool reloadHardcoded(__int64, __int64);                                                                                                                                                                                                                                                                                                                                                        // 1
	virtual bool reloadHardcodedClient(__int64, __int64);                                                                                                                                                                                                                                                                                                       // 1
